# 14. 동전
# 실패
# 어디서 많이 본 문제같더라니 냅색(배낭) 알고리즘으로 불리우는 유형의 문제였다
# 각 단위별로 만들수 있는 모든 경우의수를 차근차근 더해나가는 방식
# 다시풀자

# 15. 가장 큰 정사각형
# 모든 부분을 확인하려면 최악의경우 1000*1000^2 가 소요되니
# dp로 풀어야한다는 생각을 떠올려야한다
# 다시풀자

# 16. 팰린드롬?
# 다시풀자
# dp 왜이렇게 어렵지
# 일단. 브루트포스는 매우 높아보임
# dp는 On^2
# 안쪽부터 바깥쪽으로 뻗어나가면서
# 한칸 안쪽이 팰린드롬이면 바깥쪽이 같으면 팰린드롬으로 인지하는
# dp 기법

# 17. 돌 게임
# 다시
# 비슷한 문제의 좋은 설명 https://dailymapins.tistory.com/111

# 18. 암호코드
# 다시
# 블로그 https://jyeonnyang2.tistory.com/55
# 자꾸 dp에서 아이디어가 전혀 떠오르지 않는 이유가 뭘까
# 테이블을 명확히 정의한 후
# 예제를 정확히 써내려가면서
# 예제에대한 규칙성을 찾아내는게 dp다 규칙성을 찾는데 집중해봐
# 어떤원리로 어떤 숫자가 추가되는지 원리를 파악하는과정이야